"""
KISS
У всех программистов есть желание самовыразиться...кодом...что плохо!
Код чаще читают, чем пишут...Подумай о читателях своего кода...

ZEN PYTHON - Простое лучше сложного

---------

POLA
Вы должны НАИМЕНЬШИМ ОБРАЗОМ удивить пользователя (другого программиста)
Ваш код должен быть типовым для другого программиста...

Пример:
Если можно решить вопрос обычной сортировкой, не нужно делать сортировку пузырьком...
Иначе читающий будет в недоумении...почему пузырьком, а на по-простому, видимо есть
какой-то подвох, которого я не вижу, или нет его не самом деле...не понятно, я удивлен

Пример:
Если класс называется CAT, то я не ожидаю, что он умеет гавкать...

Пример:
Класс МАШИНА наследуется от класса ДВИГАТЕЛЬ...Как так? Что за логика?
Почему ты наследовался, а не использовал агрегацию?
"""
